### Terraform Plan — `dev` 📋

<details>
<summary>Click to expand plan output</summary>

```hcl
time=2026-03-15T00:16:52Z level=info msg=The stack at /home/runner/work/devops-infra-live/devops-infra-live/environments/dev will be processed in the following order for command plan:
Group 1
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/cloudfront
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/dynamodb
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ecs
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/eventbridge
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/s3
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sns
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sqs
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc

Group 2
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/internet-gateway
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/route53
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet

Group 3
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ec2
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/elasticache
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/lambda
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/nat-gateway
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/rds

Group 4
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/alb
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/route-table


time=2026-03-15T00:16:53Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/devops-infra-live/devops-infra-live/modules into /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/s3/.terragrunt-cache/Di5wular24ljuRwSQeQGhJt_0XY/KD9Uz34UoKkZiNL9nShh8OWWCNo prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/s3] 
time=2026-03-15T00:16:53Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/devops-infra-live/devops-infra-live/modules into /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sns/.terragrunt-cache/0J7IUSfpI53jqACebbA51pV-MgY/KD9Uz34UoKkZiNL9nShh8OWWCNo prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sns] 
time=2026-03-15T00:16:53Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/devops-infra-live/devops-infra-live/modules into /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ecs/.terragrunt-cache/X08kd6qnIblHXbZ9pAy2NHhjGVI/KD9Uz34UoKkZiNL9nShh8OWWCNo prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ecs] 
time=2026-03-15T00:16:53Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/devops-infra-live/devops-infra-live/modules into /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sqs/.terragrunt-cache/WBpxQhozj-8kmcJr-zZv2FopCVU/KD9Uz34UoKkZiNL9nShh8OWWCNo prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sqs] 
time=2026-03-15T00:16:53Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/devops-infra-live/devops-infra-live/modules into /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/dynamodb/.terragrunt-cache/j5exsj6NnfORRmFvgA4ZFTJl4Es/KD9Uz34UoKkZiNL9nShh8OWWCNo prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/dynamodb] 
time=2026-03-15T00:16:53Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/devops-infra-live/devops-infra-live/modules into /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/cloudfront/.terragrunt-cache/VYKfGQQ02mhJZzQWnIO0BLZUxCI/KD9Uz34UoKkZiNL9nShh8OWWCNo prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/cloudfront] 
time=2026-03-15T00:16:53Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/devops-infra-live/devops-infra-live/modules into /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc/.terragrunt-cache/9nDsOlT7I_lvOukZjWAdmTXrxr8/KD9Uz34UoKkZiNL9nShh8OWWCNo prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc] 
time=2026-03-15T00:16:53Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/devops-infra-live/devops-infra-live/modules into /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/eventbridge/.terragrunt-cache/MdcOvC9mbd0-zozvtHjRtXGnQ64/KD9Uz34UoKkZiNL9nShh8OWWCNo prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/eventbridge] 

Initializing the backend...

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
time=2026-03-15T00:16:53Z level=error msg=Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sqs has finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sqs/.terragrunt-cache/WBpxQhozj-8kmcJr-zZv2FopCVU/KD9Uz34UoKkZiNL9nShh8OWWCNo/sqs] exit status 1

 prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sqs] 

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing the backend...
time=2026-03-15T00:16:54Z level=error msg=Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sns has finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sns/.terragrunt-cache/0J7IUSfpI53jqACebbA51pV-MgY/KD9Uz34UoKkZiNL9nShh8OWWCNo/sns] exit status 1

 prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sns] 

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing the backend...
time=2026-03-15T00:16:54Z level=error msg=Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ecs has finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ecs/.terragrunt-cache/X08kd6qnIblHXbZ9pAy2NHhjGVI/KD9Uz34UoKkZiNL9nShh8OWWCNo/ecs] exit status 1

 prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ecs] 

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing the backend...

Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 5.0"...

Initializing the backend...
- Installing hashicorp/aws v5.100.0...

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
time=2026-03-15T00:16:55Z level=error msg=Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/cloudfront has finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/cloudfront/.terragrunt-cache/VYKfGQQ02mhJZzQWnIO0BLZUxCI/KD9Uz34UoKkZiNL9nShh8OWWCNo/cloudfront] exit status 1

 prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/cloudfront] 

Initializing the backend...

Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 5.0"...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
- Installing hashicorp/aws v5.100.0...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 5.0"...

Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 5.0"...
- Installing hashicorp/aws v5.100.0...
- Installing hashicorp/aws v5.100.0...
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
time=2026-03-15T00:17:02Z level=error msg=Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc has finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc/.terragrunt-cache/9nDsOlT7I_lvOukZjWAdmTXrxr8/KD9Uz34UoKkZiNL9nShh8OWWCNo/vpc] exit status 1

 prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc] 
time=2026-03-15T00:17:02Z level=error msg=Dependency /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc of module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/alb just finished with an error. Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/alb will have to return an error too. prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/alb] 
time=2026-03-15T00:17:02Z level=error msg=Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/alb has finished with an error: Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/alb (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc, /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet, /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group, /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ec2]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc (excluded: false, assume applied: false, dependencies: []), finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc/.terragrunt-cache/9nDsOlT7I_lvOukZjWAdmTXrxr8/KD9Uz34UoKkZiNL9nShh8OWWCNo/vpc] exit status 1

 prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/alb] 
time=2026-03-15T00:17:02Z level=error msg=Dependency /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc of module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/route53 just finished with an error. Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/route53 will have to return an error too. prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/route53] 
time=2026-03-15T00:17:02Z level=error msg=Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/route53 has finished with an error: Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/route53 (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc (excluded: false, assume applied: false, dependencies: []), finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc/.terragrunt-cache/9nDsOlT7I_lvOukZjWAdmTXrxr8/KD9Uz34UoKkZiNL9nShh8OWWCNo/vpc] exit status 1

 prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/route53] 
time=2026-03-15T00:17:02Z level=error msg=Dependency /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc of module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group just finished with an error. Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group will have to return an error too. prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group] 
time=2026-03-15T00:17:02Z level=error msg=Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group has finished with an error: Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc (excluded: false, assume applied: false, dependencies: []), finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc/.terragrunt-cache/9nDsOlT7I_lvOukZjWAdmTXrxr8/KD9Uz34UoKkZiNL9nShh8OWWCNo/vpc] exit status 1

 prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group] 
time=2026-03-15T00:17:02Z level=error msg=Dependency /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group of module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/rds just finished with an error. Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/rds will have to return an error too. prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/rds] 
time=2026-03-15T00:17:02Z level=error msg=Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/rds has finished with an error: Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/rds (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet, /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]), finished with an error: Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc (excluded: false, assume applied: false, dependencies: []), finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc/.terragrunt-cache/9nDsOlT7I_lvOukZjWAdmTXrxr8/KD9Uz34UoKkZiNL9nShh8OWWCNo/vpc] exit status 1

 prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/rds] 
time=2026-03-15T00:17:02Z level=error msg=Dependency /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group of module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/elasticache just finished with an error. Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/elasticache will have to return an error too. prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/elasticache] 
time=2026-03-15T00:17:02Z level=error msg=Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/elasticache has finished with an error: Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/elasticache (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet, /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]), finished with an error: Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc (excluded: false, assume applied: false, dependencies: []), finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc/.terragrunt-cache/9nDsOlT7I_lvOukZjWAdmTXrxr8/KD9Uz34UoKkZiNL9nShh8OWWCNo/vpc] exit status 1

 prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/elasticache] 
time=2026-03-15T00:17:02Z level=error msg=Dependency /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group of module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ec2 just finished with an error. Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ec2 will have to return an error too. prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ec2] 
time=2026-03-15T00:17:02Z level=error msg=Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ec2 has finished with an error: Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ec2 (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet, /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]), finished with an error: Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc (excluded: false, assume applied: false, dependencies: []), finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc/.terragrunt-cache/9nDsOlT7I_lvOukZjWAdmTXrxr8/KD9Uz34UoKkZiNL9nShh8OWWCNo/vpc] exit status 1

 prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ec2] 
time=2026-03-15T00:17:02Z level=error msg=Dependency /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group of module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/lambda just finished with an error. Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/lambda will have to return an error too. prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/lambda] 
time=2026-03-15T00:17:02Z level=error msg=Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/lambda has finished with an error: Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/lambda (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet, /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]), finished with an error: Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc (excluded: false, assume applied: false, dependencies: []), finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc/.terragrunt-cache/9nDsOlT7I_lvOukZjWAdmTXrxr8/KD9Uz34UoKkZiNL9nShh8OWWCNo/vpc] exit status 1

 prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/lambda] 
time=2026-03-15T00:17:02Z level=error msg=Dependency /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc of module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet just finished with an error. Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet will have to return an error too. prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet] 
time=2026-03-15T00:17:02Z level=error msg=Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet has finished with an error: Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc (excluded: false, assume applied: false, dependencies: []), finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc/.terragrunt-cache/9nDsOlT7I_lvOukZjWAdmTXrxr8/KD9Uz34UoKkZiNL9nShh8OWWCNo/vpc] exit status 1

 prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet] 
time=2026-03-15T00:17:02Z level=error msg=Dependency /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet of module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/nat-gateway just finished with an error. Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/nat-gateway will have to return an error too. prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/nat-gateway] 
time=2026-03-15T00:17:02Z level=error msg=Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/nat-gateway has finished with an error: Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/nat-gateway (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]), finished with an error: Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc (excluded: false, assume applied: false, dependencies: []), finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc/.terragrunt-cache/9nDsOlT7I_lvOukZjWAdmTXrxr8/KD9Uz34UoKkZiNL9nShh8OWWCNo/vpc] exit status 1

 prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/nat-gateway] 
time=2026-03-15T00:17:02Z level=error msg=Dependency /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc of module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/internet-gateway just finished with an error. Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/internet-gateway will have to return an error too. prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/internet-gateway] 
time=2026-03-15T00:17:02Z level=error msg=Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/internet-gateway has finished with an error: Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/internet-gateway (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc (excluded: false, assume applied: false, dependencies: []), finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc/.terragrunt-cache/9nDsOlT7I_lvOukZjWAdmTXrxr8/KD9Uz34UoKkZiNL9nShh8OWWCNo/vpc] exit status 1

 prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/internet-gateway] 
time=2026-03-15T00:17:02Z level=error msg=Dependency /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc of module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/route-table just finished with an error. Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/route-table will have to return an error too. prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/route-table] 
time=2026-03-15T00:17:02Z level=error msg=Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/route-table has finished with an error: Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/route-table (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc, /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet, /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/internet-gateway, /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/nat-gateway]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc (excluded: false, assume applied: false, dependencies: []), finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc/.terragrunt-cache/9nDsOlT7I_lvOukZjWAdmTXrxr8/KD9Uz34UoKkZiNL9nShh8OWWCNo/vpc] exit status 1

 prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/route-table] 

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.this["devops-aditya-26950"] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "devops-aditya-26950"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "ManagedBy" = "terraform"
          + "Name"      = "devops-aditya-26950"
          + "Project"   = "my-infra"
        }
      + tags_all                    = {
          + "ManagedBy" = "terraform"
          + "Name"      = "devops-aditya-26950"
          + "Project"   = "my-infra"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_public_access_block.this["devops-aditya-26950"] will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.this["devops-aditya-26950"] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "aws:kms"
            }
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ bucket_arns         = {
      + devops-aditya-26950 = (known after apply)
    }
  ~ bucket_domain_names = {
      + devops-aditya-26950 = (known after apply)
    }
  ~ bucket_ids          = {
      + devops-aditya-26950 = (known after apply)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
time=2026-03-15T00:17:06Z level=info msg=Terraform encountered problems during initialisation, including problems
with the configuration, described below.

The Terraform configuration must be valid before initialization so that
Terraform can determine which modules and providers need to be installed.

Error: Invalid character

  on variables.tf line 2, in variable "project":
   2: variable "project" { type = string; default = "devops-ai" }

The ";" character is not valid. Use newlines to separate arguments and
blocks, and commas to separate items in collection values.


Error: Invalid single-argument block definition

  on variables.tf line 2, in variable "project":
   2: variable "project" { type = string; default = "devops-ai" }

A single-line block definition must end with a closing brace immediately
after its single argument definition.

time=2026-03-15T00:16:55Z level=error msg=terraform invocation failed in /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/cloudfront/.terragrunt-cache/VYKfGQQ02mhJZzQWnIO0BLZUxCI/KD9Uz34UoKkZiNL9nShh8OWWCNo/cloudfront prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/cloudfront] 

time=2026-03-15T00:17:06Z level=info msg=Terraform encountered problems during initialisation, including problems
with the configuration, described below.

The Terraform configuration must be valid before initialization so that
Terraform can determine which modules and providers need to be installed.

Error: Invalid character

  on variables.tf line 2, in variable "project":
   2: variable "project" { type = string; default = "devops-ai" }

The ";" character is not valid. Use newlines to separate arguments and
blocks, and commas to separate items in collection values.


Error: Invalid single-argument block definition

  on variables.tf line 2, in variable "project":
   2: variable "project" { type = string; default = "devops-ai" }

A single-line block definition must end with a closing brace immediately
after its single argument definition.

time=2026-03-15T00:16:54Z level=error msg=terraform invocation failed in /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ecs/.terragrunt-cache/X08kd6qnIblHXbZ9pAy2NHhjGVI/KD9Uz34UoKkZiNL9nShh8OWWCNo/ecs prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ecs] 

time=2026-03-15T00:17:06Z level=info msg=Terraform encountered problems during initialisation, including problems
with the configuration, described below.

The Terraform configuration must be valid before initialization so that
Terraform can determine which modules and providers need to be installed.

Error: Invalid character

  on variables.tf line 2, in variable "project":
   2: variable "project" { type = string; default = "devops-ai" }

The ";" character is not valid. Use newlines to separate arguments and
blocks, and commas to separate items in collection values.


Error: Invalid single-argument block definition

  on variables.tf line 2, in variable "project":
   2: variable "project" { type = string; default = "devops-ai" }

A single-line block definition must end with a closing brace immediately
after its single argument definition.

time=2026-03-15T00:16:54Z level=error msg=terraform invocation failed in /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sns/.terragrunt-cache/0J7IUSfpI53jqACebbA51pV-MgY/KD9Uz34UoKkZiNL9nShh8OWWCNo/sns prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sns] 

time=2026-03-15T00:17:06Z level=info msg=Terraform encountered problems during initialisation, including problems
with the configuration, described below.

The Terraform configuration must be valid before initialization so that
Terraform can determine which modules and providers need to be installed.

Error: Invalid character

  on variables.tf line 2, in variable "project":
   2: variable "project" { type = string; default = "devops-ai" }

The ";" character is not valid. Use newlines to separate arguments and
blocks, and commas to separate items in collection values.


Error: Invalid single-argument block definition

  on variables.tf line 2, in variable "project":
   2: variable "project" { type = string; default = "devops-ai" }

A single-line block definition must end with a closing brace immediately
after its single argument definition.

time=2026-03-15T00:16:53Z level=error msg=terraform invocation failed in /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sqs/.terragrunt-cache/WBpxQhozj-8kmcJr-zZv2FopCVU/KD9Uz34UoKkZiNL9nShh8OWWCNo/sqs prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sqs] 

time=2026-03-15T00:17:06Z level=info msg=
Error: Error acquiring the state lock

Error message: operation error DynamoDB: PutItem, https response error
StatusCode: 400, RequestID:
ULNG8SVJ2E57LJTJESULUHL8N3VV4KQNSO5AEMVJF66Q9ASUAAJG,
ConditionalCheckFailedException: The conditional request failed
Lock Info:
  ID:        bc545923-7be2-e6bd-8701-f6f0300e641d
  Path:      my-infra-tf-state-978184426471/dev/vpc/terraform.tfstate
  Operation: OperationTypeApply
  Who:       runner@runnervm46oaq
  Version:   1.7.5
  Created:   2026-03-14 20:50:53.531255758 +0000 UTC
  Info:      


Terraform acquires a state lock to protect the state from being written
by multiple users at the same time. Please resolve the issue above and try
again. For most commands, you can disable locking with the "-lock=false"
flag, but this is not recommended.
time=2026-03-15T00:17:02Z level=error msg=terraform invocation failed in /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc/.terragrunt-cache/9nDsOlT7I_lvOukZjWAdmTXrxr8/KD9Uz34UoKkZiNL9nShh8OWWCNo/vpc prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc] 

time=2026-03-15T00:17:06Z level=error msg=16 errors occurred:
	* Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/route53 (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc (excluded: false, assume applied: false, dependencies: []), finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc/.terragrunt-cache/9nDsOlT7I_lvOukZjWAdmTXrxr8/KD9Uz34UoKkZiNL9nShh8OWWCNo/vpc] exit status 1


	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc/.terragrunt-cache/9nDsOlT7I_lvOukZjWAdmTXrxr8/KD9Uz34UoKkZiNL9nShh8OWWCNo/vpc] exit status 1
	* Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/alb (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc, /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet, /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group, /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ec2]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc (excluded: false, assume applied: false, dependencies: []), finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc/.terragrunt-cache/9nDsOlT7I_lvOukZjWAdmTXrxr8/KD9Uz34UoKkZiNL9nShh8OWWCNo/vpc] exit status 1


	* Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/internet-gateway (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc (excluded: false, assume applied: false, dependencies: []), finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc/.terragrunt-cache/9nDsOlT7I_lvOukZjWAdmTXrxr8/KD9Uz34UoKkZiNL9nShh8OWWCNo/vpc] exit status 1


	* Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/nat-gateway (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]), finished with an error: Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc (excluded: false, assume applied: false, dependencies: []), finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc/.terragrunt-cache/9nDsOlT7I_lvOukZjWAdmTXrxr8/KD9Uz34UoKkZiNL9nShh8OWWCNo/vpc] exit status 1


	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/cloudfront/.terragrunt-cache/VYKfGQQ02mhJZzQWnIO0BLZUxCI/KD9Uz34UoKkZiNL9nShh8OWWCNo/cloudfront] exit status 1
	* Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/route-table (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc, /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet, /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/internet-gateway, /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/nat-gateway]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc (excluded: false, assume applied: false, dependencies: []), finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc/.terragrunt-cache/9nDsOlT7I_lvOukZjWAdmTXrxr8/KD9Uz34UoKkZiNL9nShh8OWWCNo/vpc] exit status 1


	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sns/.terragrunt-cache/0J7IUSfpI53jqACebbA51pV-MgY/KD9Uz34UoKkZiNL9nShh8OWWCNo/sns] exit status 1
	* Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ec2 (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet, /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]), finished with an error: Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc (excluded: false, assume applied: false, dependencies: []), finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc/.terragrunt-cache/9nDsOlT7I_lvOukZjWAdmTXrxr8/KD9Uz34UoKkZiNL9nShh8OWWCNo/vpc] exit status 1


	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sqs/.terragrunt-cache/WBpxQhozj-8kmcJr-zZv2FopCVU/KD9Uz34UoKkZiNL9nShh8OWWCNo/sqs] exit status 1
	* Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/elasticache (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet, /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]), finished with an error: Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc (excluded: false, assume applied: false, dependencies: []), finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc/.terragrunt-cache/9nDsOlT7I_lvOukZjWAdmTXrxr8/KD9Uz34UoKkZiNL9nShh8OWWCNo/vpc] exit status 1


	* Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/lambda (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet, /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]), finished with an error: Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc (excluded: false, assume applied: false, dependencies: []), finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc/.terragrunt-cache/9nDsOlT7I_lvOukZjWAdmTXrxr8/KD9Uz34UoKkZiNL9nShh8OWWCNo/vpc] exit status 1


	* Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc (excluded: false, assume applied: false, dependencies: []), finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc/.terragrunt-cache/9nDsOlT7I_lvOukZjWAdmTXrxr8/KD9Uz34UoKkZiNL9nShh8OWWCNo/vpc] exit status 1


	* Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc (excluded: false, assume applied: false, dependencies: []), finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc/.terragrunt-cache/9nDsOlT7I_lvOukZjWAdmTXrxr8/KD9Uz34UoKkZiNL9nShh8OWWCNo/vpc] exit status 1


	* Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/rds (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet, /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]), finished with an error: Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc (excluded: false, assume applied: false, dependencies: []), finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc/.terragrunt-cache/9nDsOlT7I_lvOukZjWAdmTXrxr8/KD9Uz34UoKkZiNL9nShh8OWWCNo/vpc] exit status 1


	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ecs/.terragrunt-cache/X08kd6qnIblHXbZ9pAy2NHhjGVI/KD9Uz34UoKkZiNL9nShh8OWWCNo/ecs] exit status 1



```

</details>

*Merge this PR to apply changes for project `dev`.*